Revit 2027 API
BuiltInFailures.ExportFailures.SwitchToRasterProcessingInsteadOfVectorWarning Property
 Some of the views have been switched to raster processing though vector processing is selected.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SwitchToRasterProcessingInsteadOfVectorWarning { get; }
Public Shared ReadOnly Property SwitchToRasterProcessingInsteadOfVectorWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SwitchToRasterProcessingInsteadOfVectorWarning {
	FailureDefinitionId^ get ();
}
static member SwitchToRasterProcessingInsteadOfVectorWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ExportFailures Class
Autodesk.Revit.DB Namespace